Repository: JHdehao/Conch
Catalog: Conch/Localizable.xcstrings
Source language: zh_hans
Languages: en, zh_hant

# …（全文共 %lld 字，这里是 %lld–%lld。继续读传 start=%lld）
source: …（全文共 %1$lld 字，这里是 %2$lld–%3$lld。继续读传 start=%4$lld）
en: …(%lld characters in total; this is %lld–%lld. Pass start=%lld to read on)
zh_hant: …（全文共 %lld 字，這裡是 %lld–%lld。繼續讀傳 start=%lld）

source: 服务器输出： %@
en: Server output: %@
zh_hant: 伺服器輸出： %@

source: （Bing 搜索结果只有摘要，需要细节时用 web_fetch 读取原文）
en: (Bing results are snippets only; use web_fetch to read a page for details)
zh_hant: （Bing 搜尋結果只有摘要，需要細節時用 web_fetch 讀取原文）

source: …（结果太长，已截断）
en: …(result too long, truncated)
zh_hant: …（結果太長，已截斷）

source: 地址：%@
en: Address: %@
zh_hant: 位址：%@

source: 它想使用 %@，但当前权限模式不允许；用户可以在“AI 编程”窗口里点“允许并继续”。
en: It wants to use %@, but the current permission mode doesn't allow it; the user can tap “Allow and Continue” in the AI Coding window.
zh_hant: 它想使用 %@，但當前權限模式不允許；使用者可以在“AI 編程”窗口裡點“允許並繼續”。

source: 终端里最近的错误：%@
en: Most recent error in the terminal: %@
zh_hant: 終端里最近的錯誤：%@

source: [2m[已重新连接][0m
en: [2m[Reconnected][0m
zh_hant: [2m[已重新連線][0m

source: [2m[连接已关闭 · 按回车键重新连接][0m
en: [2m[Connection closed · Press Return to reconnect][0m
zh_hant: [2m[連線已關閉 · 按回車鍵重新連線][0m

source: …（这个文件里还有 %lld 处）
en: … (%lld more in this file)
zh_hant: …（這個檔案裡還有 %lld 處）

source: 分组=%@
en: group=%@
zh_hant: 分組=%@

source: 最近错误：%@
en: last error: %@
zh_hant: 最近錯誤：%@

source: 电话：%@
en: phone: %@
zh_hant: 電話：%@

source: 邮箱：%@
en: email: %@
zh_hant: 電子郵件：%@

source: %@ %@ 在那台电脑上没有登录或登录已过期。请在电脑终端里运行 `%@` 登录一次（或在 Conch 里连上终端后登录），然后重试。
en: %@ %@ isn't signed in on that computer, or the sign-in has expired. Run `%@` once in a terminal on the computer to sign in (or connect a terminal in Conch and sign in there), then try again.
zh_hant: %@ %@ 在那台電腦上沒有登入或登入已過期。請在電腦終端里執行 `%@` 登入一次（或在 Conch 里連上終端後登入），然後重試。

source: %@ 找不到要继续的会话，可能已被删除。新建一个对话试试。
en: %@ The session to continue couldn't be found; it may have been deleted. Try starting a new conversation.
zh_hant: %@ 找不到要繼續的會話，可能已被刪除。新建一個對話試試。

source: %@ … 省略 %lld 个字符 … %@
en: %1$@ … %2$lld characters omitted … %3$@
zh_hant: %@ … 省略 %lld 個字元 … %@

source: %@ · 可能会提交表单
en: %@ · may submit a form
zh_hant: %@ · 可能會提交表單

# %@ · 思考强度 %@
source: %1$@ · 思考强度 %2$@
en: %@ · %@ effort
zh_hant: %@ · 思考強度 %@

# %@ → %@的 %@
source: %1$@ → %2$@的 %3$@
en: %1$@ → %3$@ in %2$@
zh_hant: %@ → %@的 %@

source: %@ 内存
en: %@ memory
zh_hant: %@ 記憶體

source: %@ 到期
en: Due %@

source: %@ 取消了发送。
en: %@ cancelled the transfer.
zh_hant: %@ 取消了傳送。

source: %@ 在一次调用里只能有一个操作；要改写再接着插入，就用 set 并在 text 里换行
en: %@ can only take one operation per call; to rewrite it and insert after it, use set with line breaks in text
zh_hant: %@ 在一次調用裡只能有一個操作；要改寫再接著插入，就用 set 並在 text 裡換行

source: %@ 完成了：
en: %@ finished:

source: %@ 想使用 %@，但当前模式不允许。
en: %@ wants to use %@, but the current mode doesn't allow it.
zh_hant: %@ 想使用 %@，但當前模式不允許。

source: %@ 想发送
en: %@ wants to send
zh_hant: %@ 想傳送

source: %@ 想要%@
en: %1$@ wants to: %2$@

source: %@ 意外退出了。
en: %@ exited unexpectedly.

source: %@ 暂时无法识别，可能需要联网。右键点按麦克风可以换一种识别语言。
en: %@ recognition isn't available right now; it may need an internet connection. Control-click the microphone to pick another language.
zh_hant: %@ 暫時無法辨識，可能需要連上網路。按右鍵點按麥克風可以換一種辨識語言。

source: %@ 暂时无法识别，可能需要联网。长按麦克风可以换一种识别语言。
en: %@ recognition isn't available right now; it may need an internet connection. Touch and hold the microphone to pick another language.
zh_hant: %@ 暫時無法辨識，可能需要連上網路。長按麥克風可以換一種辨識語言。

source: %@ 正在工作… %llds
en: %@ is working… %llds

source: %@ 没有接收
en: %@ didn't accept
zh_hant: %@ 沒有接收

source: %@ 的模型
en: %@ Models

source: %@ 起 %lld 天内没有日程
en: No events in the %2$lld days from %1$@
zh_hant: %@ 起 %lld 天內沒有行事曆事件

source: %@ 还在工作（已在“AI 编程”窗口打开，可以继续等或让用户去看）。目前进展：
en: %@ is still working (it's open in the AI Coding window; you can keep waiting or let the user check). Progress so far:
zh_hant: %@ 還在工作（已在“AI 編程”窗口打開，可以繼續等或讓使用者去看）。目前進展：

# %@（%@）→ %@，同名文件会被覆盖
source: %1$@（%2$@）→ %3$@，同名文件会被覆盖
en: %@ (%@) → %@; a file with the same name will be replaced
zh_hant: %@（%@）→ %@，同名檔案會被覆蓋

source: %lld 个出错
en: %lld failed
zh_hant: %lld 個出錯

source: %lld 个分屏
en: %lld panes
zh_hant: %lld 個分割畫面

source: %lld 个对话进行中
en: %lld running
zh_hant: %lld 個對話進行中

source: %lld 个文件
en: %lld files
zh_hant: %lld 個檔案

source: %lld 个文件有改动
en: %lld files changed
zh_hant: %lld 個檔案有改動

source: %lld 个服务器密码
en: %lld server passwords
zh_hant: %lld 個伺服器密碼

source: %lld 个附件
en: %lld attachments
zh_hant: %lld 個附件

source: %lld 分 %lld 秒
en: %lld min %lld s

source: %lld 分钟
en: %lld minutes
zh_hant: %lld 分鐘

source: %lld 台
en: %lld servers

source: %lld 台已是最新
en: %lld already up to date

source: %lld 台服务器
en: %lld servers
zh_hant: %lld 台伺服器

source: %lld 把私钥
en: %lld private keys
zh_hant: %lld 把私密金鑰

source: %lld 条
en: %lld
zh_hant: %lld 條

source: %lld 条中途发送的消息 %@ 没有读到。
en: %1$lld messages sent mid-turn weren't read by %2$@.
zh_hant: %1$lld 則中途發送的訊息 %2$@ 沒有讀到。

source: %lld 条主机指纹
en: %lld host fingerprints
zh_hant: %lld 條主機指紋

source: %lld 条已知主机指纹
en: %lld known host fingerprints
zh_hant: %lld 條已知主機指紋

source: %lld 核
en: %lld cores

source: %lld 秒
en: %lld seconds

source: %lld 轮
en: %lld turns
zh_hant: %lld 輪

# %lld 项 · %@
source: %1$lld 项 · %2$@
en: %lld items · %@
zh_hant: %lld 項 · %@

# - %@（%@%@，内容没有直接发送：用 read_document 读，edit_document 编辑）
source: - %1$@（%2$@%3$@，内容没有直接发送：用 read_document 读，edit_document 编辑）
en: - %@ (%@%@; contents not sent directly: read it with read_document, edit it with edit_document)
zh_hant: - %@（%@%@，內容沒有直接發送：用 read_document 讀，edit_document 編輯）

# - %@（%@，%@%@，内容没有直接发送）
source: - %1$@（%2$@，%3$@%4$@，内容没有直接发送）
en: - %@ (%@, %@%@; contents not sent directly)
zh_hant: - %@（%@，%@%@，內容沒有直接發送）

source: - %@（文件已不在本机）
en: - %@ (file no longer on this device)
zh_hant: - %@（檔案已不在本機）

source: - id=%@ 名称=%@ 地址=%@ 协议=%@ 认证=%@
en: - id=%@ name=%@ address=%@ protocol=%@ auth=%@
zh_hant: - id=%@ 名稱=%@ 位址=%@ 協議=%@ 認證=%@

source: 1 分钟
en: 1 min
zh_hant: 1 分鐘

source: 1 小时
en: 1 hour
zh_hant: 1 小時

source: 15 分钟
en: 15 min
zh_hant: 15 分鐘

source: 2 小时
en: 2 hours
zh_hant: 2 小時

source: 20 秒内还没连上，当前状态：%@
en: Not connected after 20 seconds. Current state: %@
zh_hant: 20 秒內還沒連上，當前狀態：%@

source: 5 分钟
en: 5 min
zh_hant: 5 分鐘

source: AI 助手
en: AI Assistant

source: AI 助手设置
en: AI assistant settings
zh_hant: AI 助理設定

source: AI 助手设置和 API Key
en: AI Assistant Settings and API Key
zh_hant: AI 助理設定和 API Key

source: AI 助手（⌘J）
en: AI Assistant (⌘J)

source: AI 服务暂时繁忙（%lld），稍后再试。
en: The AI service is busy (%lld). Try again later.
zh_hant: AI 服務暫時繁忙（%lld），稍後再試。

source: AI 服务设置
en: AI Service Settings
zh_hant: AI 服務設定

source: AI 服务返回错误（%lld）：%@
en: The AI service returned an error (%lld): %@
zh_hant: AI 服務返回錯誤（%lld）：%@

source: AI 编程
en: AI Coding
zh_hant: AI 編程

source: AI 编程（Claude Code / Codex）
en: AI Coding (Claude Code / Codex)
zh_hant: AI 編程（Claude Code / Codex）

source: API Key 无效或已过期（401）。请在设置 → AI 助手里检查。
en: The API key is invalid or expired (401). Check it in Settings → AI Assistant.
zh_hant: API Key 無效或已過期（401）。請在設定 → AI 助手裡檢查。

source: API 地址格式不正确。
en: The API address isn't valid.
zh_hant: API 位址格式不正確。

source: Auth Key（可选）
en: Auth Key (optional)
zh_hant: Auth Key（選填）

source: Claude Code / Codex 不用全屏模式
en: Claude Code / Codex without full screen
zh_hant: Claude Code / Codex 不用全螢幕模式

source: Claude 夜
en: Claude Night

source: Claude 昼
en: Claude Day
zh_hant: Claude 晝

source: Codex 压缩了上下文
en: Codex compacted the context
zh_hant: Codex 壓縮了上下文

source: Codex 没有 /%@ 这个命令。输入 / 查看可用的命令。
en: Codex has no /%@ command. Type / to see the available commands.
zh_hant: Codex 沒有 /%@ 這個命令。輸入 / 查看可用的命令。

source: Codex 没能打开这个会话。
en: Codex couldn't open this conversation.
zh_hant: Codex 無法打開這個對話。

source: Conch 会在 App 里运行一个 Tailscale 节点，连接 Tailnet 里的设备，不影响系统 VPN。
en: Conch will run a Tailscale node inside the app to reach devices on your tailnet. The system VPN isn't affected.
zh_hant: Conch 會在 App 裡執行一個 Tailscale 節點，連線 Tailnet 裡的裝置，不影響系統 VPN。

source: Conch 助手
en: Conch Assistant

source: Conch 助手会把你的消息发给 %@ 来生成回复。为了完成你交代的事，它还可能读取并发送：
en: Conch Assistant sends your messages to %@ to generate replies. To do what you ask, it may also read and send:
zh_hant: Conch 助理會把你的訊息傳給 %@ 來產生回覆。為了完成你交代的事，它還可能讀取並傳送：

source: Conch 已在后台保持连接 %@，连接稍后会断开。回到 Conch 会自动重连。
en: Conch kept your connections alive in the background for %@. They'll drop shortly; opening Conch reconnects them.
zh_hant: Conch 已在後台保持連線 %@，連線稍後會中斷。回到 Conch 會自動重連。

source: Conch 服务器 %@
en: Conch Servers %@
zh_hant: Conch 伺服器 %@

source: Conch 本身不收集这些数据，它们只发给上面提到的服务，按各自的隐私政策处理。可以随时在 AI 服务设置里撤回，或关掉快速联网。
en: Conch itself doesn't collect this data. It only goes to the services named above and is handled under their privacy policies. You can withdraw at any time in AI service settings, or turn off fast lookup.
zh_hant: Conch 本身不收集這些資料，它們只傳給上面提到的服務，依各自的隱私權政策處理。可以隨時在 AI 服務設定裡撤回，或關掉快速聯網。

source: Conch 本身不收集这些数据，它们只发给这个服务，按它的隐私政策处理。可以随时在 AI 服务设置里撤回。
en: Conch itself doesn't collect this data. It goes only to this service and is handled under its privacy policy. You can withdraw consent anytime in AI service settings.
zh_hant: Conch 本身不收集這些資料，它們只傳給這個服務，依它的隱私權政策處理。可以隨時在 AI 服務設定裡撤回。

source: Conch 的文稿文件夹
en: Conch's Documents folder
zh_hant: Conch 的文件資料夾

source: Conch 自带一个 Tailscale 客户端，跑在 App 内部，不占用系统 VPN，可以和小火箭等代理同时开着。打开后，连接 100.x 地址、MagicDNS 名称（如 nas 或 nas.xxx.ts.net）的服务器会自动走 Tailscale，其他连接不受影响。
en: Conch includes its own Tailscale client that runs inside the app. It doesn't use the system VPN, so it works alongside Shadowrocket and other proxies. When on, connections to 100.x addresses and MagicDNS names (like nas or nas.xxx.ts.net) go through Tailscale; other connections are unaffected.
zh_hant: Conch 自帶一個 Tailscale 用戶端，跑在 App 內部，不佔用系統 VPN，可以和小火箭等代理同時開著。打開後，連線 100.x 位址、MagicDNS 名稱（如 nas 或 nas.xxx.ts.net）的伺服器會自動走 Tailscale，其他連線不受影響。

source: IP 地址或主机名
en: IP address or hostname
zh_hant: IP 位址或主機名稱

source: OpenAI 兼容接口
en: OpenAI-compatible
zh_hant: OpenAI 兼容介面

source: PDF 里找不到要改的文字（可能是扫描件，或者文字被拆成了图形）
en: The text to change isn't in the PDF (it may be a scan, or the text was turned into shapes)
zh_hant: PDF 裡找不到要改的文字（可能是掃描件，或者文字被拆成了圖形）

source: PDFium 打不开这个 PDF
en: PDFium can't open this PDF
zh_hant: PDFium 打不開這個 PDF

source: SSH 连上后，在这个终端里让 Claude Code 和 Codex 把输出留在终端的滚动记录里，往回翻在本机滑动，不再每一下都等电脑重绘。只影响 Conch 打开的终端，电脑上照旧。Mosh 没有滚动记录，不适用。新开的终端生效。
en: Over SSH, Claude Code and Codex in this terminal keep their output in the terminal's scrollback, so scrolling back happens on this device instead of waiting for the computer to redraw each step. Only affects terminals Conch opens; the computer is unchanged. Not for Mosh, which has no scrollback. Applies to new terminals.
zh_hant: SSH 連上後，在這個終端機裡讓 Claude Code 和 Codex 把輸出留在終端機的捲動記錄裡，往回翻在本機滑動，不再每一下都等電腦重繪。只影響 Conch 開啟的終端機，電腦上照舊。Mosh 沒有捲動記錄，不適用。新開的終端機生效。

source: Solarized 亮
en: Solarized Light

source: Solarized 暗
en: Solarized Dark

source: Tailnet 里没有其他设备
en: No other devices on the tailnet
zh_hant: Tailnet 裡沒有其他裝置

source: Tailscale 显示这台设备离线
en: Tailscale shows this device as offline
zh_hant: Tailscale 顯示這台裝置離線

source: Tailscale 设置
en: Tailscale settings
zh_hant: Tailscale 設定

source: Tailscale 设置（控制服务器、Auth Key）
en: Tailscale settings (control server, auth key)
zh_hant: Tailscale 設定（控制伺服器、Auth Key）

source: Tailscale：出错了：%@
en: Tailscale: error: %@
zh_hant: Tailscale：出錯了：%@

# Tailscale：已连接（%@，%lld/%lld 台设备在线）
source: Tailscale：已连接（%1$@，%2$lld/%3$lld 台设备在线）
en: Tailscale: connected (%@, %lld/%lld devices online)
zh_hant: Tailscale：已連線（%@，%lld/%lld 台裝置在線）

source: Tailscale：未开启
en: Tailscale: off
zh_hant: Tailscale：未開啟

source: Tailscale：未运行
en: Tailscale: not running
zh_hant: Tailscale：未執行

source: Tailscale：正在启动
en: Tailscale: starting
zh_hant: Tailscale：正在啟動

source: Tailscale：需要登录
en: Tailscale: sign-in needed
zh_hant: Tailscale：需要登入

source: VPN/其他
en: VPN/other

source: [%@没有发送：当前模型不支持]
en: [%@ not sent: the current model doesn't support it]
zh_hant: [%@沒有傳送：目前模型不支援]

source: [早先附上的%@，已不再随消息重发]
en: [%@ attached earlier; no longer resent with each message]
zh_hant: [早先附上的%@，已不再隨訊息重傳]

source: [用户在你做事的过程中发来这条消息。如果是在纠正你或改变方向，马上照此调整接下来的做法；如果是追加的新任务，先把手上的任务做完再接着做它，不要丢下当前任务。已经做完的不用重做。]
en: [The user sent this while you were working. If it corrects you or changes direction, adjust what you do next right away; if it adds a new task, finish the current task first and then do it, without dropping what you're doing. Don't redo what's already done.]
zh_hant: [使用者在你做事的過程中發來這條消息。如果是在糾正你或改變方向，馬上照此調整接下來的做法；如果是追加的新任務，先把手上的任務做完再接著做它，不要丟下當前任務。已經做完的不用重做。]

source: [用户打断了你正在做的那一步，发来这条消息：它多半是在纠正你或改变方向。先照它调整，再决定原来的事还要不要继续。]
en: [The user interrupted the step you were on to send this; it most likely corrects you or changes direction. Adjust to it first, then decide whether the original task should go on.]
zh_hant: [使用者打斷了你正在做的那一步，發來這條消息：它多半是在糾正你或改變方向。先照它調整，再決定原來的事還要不要繼續。]

source: [用户附上了这些文件]
en: [The user attached these files]
zh_hant: [使用者附上了這些檔案]

source: example.com 或 192.168.1.10
en: example.com or 192.168.1.10

source: iOS 会在 App 离开屏幕约 30 秒后暂停它，连接随之中断。开启后，只要有连接在用，Conch 会用最低精度的定位保持在后台运行（状态栏会显示定位图标）。离开 Conch 超过设定时长、或所有连接都已断开时自动停止。
en: iOS pauses apps about 30 seconds after they leave the screen, which drops their connections. When this is on and a connection is in use, Conch keeps running in the background with the lowest-accuracy location (the status bar shows the location icon). It stops after the time you choose, or once every connection has closed.
zh_hant: iOS 會在 App 離開螢幕約 30 秒後暫停它，連線隨之中斷。開啓後，只要有連線在用，Conch 會用最低精度的定位保持在後台執行（狀態欄會顯示定位圖標）。離開 Conch 超過設定時長、或所有連線都已中斷時自動停止。

source: mosh-server 启动失败。%@
en: mosh-server failed to start. %@
zh_hant: mosh-server 啓動失敗。%@

source: mosh-server 命令
en: mosh-server command

source: mosh-server 返回的会话密钥无效。
en: mosh-server returned an invalid session key.
zh_hant: mosh-server 返回的會話金鑰無效。

source: replace 的 find 不能为空
en: replace needs a non-empty find
zh_hant: replace 的 find 不能為空

source: “%@”在共享文件夹外面
en: “%@” is outside the shared folder
zh_hant: “%@”在共享資料夾外面

# “%@”太大了，附件最大 %@。
source: “%1$@”太大了，附件最大 %2$@。
en: “%@” is too large. Attachments can be up to %@.
zh_hant: 「%@」太大了，附件最大 %@。

# “%@”改成了“%@”，%lld 处
source: “%1$@”改成了“%2$@”，%3$lld 处
en: Changed “%@” to “%@” (%lld places)
zh_hant: “%@”改成了“%@”，%lld 處

# “%@”替换了 %lld 处
source: “%1$@”替换了 %2$lld 处
en: Replaced “%@” in %lld places
zh_hant: “%@”替換了 %lld 處

source: “文件” › 我的 iPhone › Conch
en: Files › On My iPhone › Conch
zh_hant: “檔案” › 我的 iPhone › Conch

source: • Mac：系统设置 › 通用 › 共享，打开“远程登录”。Linux：确认 sshd 在运行。
en: • Mac: in System Settings › General › Sharing, turn on “Remote Login”. Linux: make sure sshd is running.
zh_hant: • Mac：系統設定 › 通用 › 共享，打開“遠端登入”。Linux：確認 sshd 在執行。

source: • 不在同一网络：在电脑和手机上都安装 Tailscale 并登录同一账号，然后地址填电脑的 100.x.x.x 地址或 MagicDNS 名称（如 my-mac.tail1234.ts.net）。
en: • On different networks: install Tailscale on both the computer and the phone, sign in to the same account, then use the computer's 100.x.x.x address or MagicDNS name (like my-mac.tail1234.ts.net).
zh_hant: • 不在同一網路：在電腦和手機上都安裝 Tailscale 並登入同一賬號，然後位址填電腦的 100.x.x.x 位址或 MagicDNS 名稱（如 my-mac.tail1234.ts.net）。

source: • 同一 Wi‑Fi：地址填电脑的局域网 IP 或 “电脑名.local”。
en: • On the same Wi‑Fi: use the computer's LAN IP or “computer-name.local”.
zh_hant: • 同一 Wi‑Fi：位址填電腦的局域網 IP 或 “電腦名.local”。

source: • 电脑上要先装好并登录 Claude Code（claude）或 Codex（codex）。
en: • Claude Code (claude) or Codex (codex) must be installed and signed in on the computer.
zh_hant: • 電腦上要先裝好並登入 Claude Code（claude）或 Codex（codex）。

source: …(前面省略)
en: …(earlier output omitted)

# …（共 %lld 个文件匹配，只列了前 %lld 个，把条件写得更具体些）
source: …（共 %1$lld 个文件匹配，只列了前 %2$lld 个，把条件写得更具体些）
en: … (%lld files match; only the first %lld are listed, so narrow the search)
zh_hant: …（共 %lld 個檔案匹配，只列了前 %lld 個，把條件寫得更具體些）

source: …（共 %lld 项，只列了前 500 项）
en: … (%lld items in total; only the first 500 are listed)
zh_hant: …（共 %lld 項，只列了前 500 項）

source: …（只列出前 %lld 处）
en: …(showing the first %lld only)
zh_hant: …（只列出前 %lld 處）

source: …（后面还有 %lld 页，太长省略了）
en: … (%lld more pages left out; too long)
zh_hant: …（後面還有 %lld 頁，太長省略了）

source: …（后面还有，已截断）
en: … (truncated)
zh_hant: …（後面還有，已截斷）

source: …（太长，后面省略了）
en: … (too long; the rest is left out)
zh_hant: …（太長，後面省略了）

# …（还有 %lld 字没显示，用 browser_read start=%lld 继续读，或用 browser_find 查找）
source: …（还有 %1$lld 字没显示，用 browser_read start=%2$lld 继续读，或用 browser_find 查找）
en: …(%lld more characters not shown; use browser_read start=%lld to continue, or browser_find to search)
zh_hant: …（還有 %lld 字沒顯示，用 browser_read start=%lld 繼續讀，或用 browser_find 查找）

source: ── 工作表 %@ ──
en: ── Sheet %@ ──

source: ── 第 %lld 页 ──
en: ── Page %lld ──
zh_hant: ── 第 %lld 頁 ──

source: ── 表单字段 ──
en: ── Form fields ──
zh_hant: ── 表單字段 ──

source: ✅ 连接成功（%@）
en: ✅ Connected (%@)
zh_hant: ✅ 連線成功（%@）

source: 上一个标签页
en: Previous Tab
zh_hant: 上一個分頁

source: 上一级
en: Up One Level
zh_hant: 上一級

source: 上一题
en: Back
zh_hant: 上一題

source: 上下文已用 %lld%%（%@ / %@）
en: Context %lld%% used (%@ / %@)

source: 上传
en: Up
zh_hant: 上傳

# 上传到 %@：%@
source: 上传到 %1$@：%2$@
en: Upload to %@: %@
zh_hant: 上傳到 %@：%@

source: 上传文件到 %@？
en: Upload a file to %@?
zh_hant: 上傳檔案到 %@？

source: 下一个标签页
en: Next Tab
zh_hant: 下一個分頁

source: 下一句建议
en: Next-Prompt Suggestions
zh_hant: 下一句建議

source: 下一题
en: Next
zh_hant: 下一題

source: 下划线
en: Underline
zh_hant: 下划線

source: 下载
en: Down
zh_hant: 下載

source: 不再询问，任何命令都会直接执行。只在你信任的环境里用。
en: Never asks; every command runs right away. Only use it in an environment you trust.
zh_hant: 不再詢問，任何命令都會直接執行。只在你信任的環境里用。

source: 不受沙盒限制，任何命令都会直接执行。只在你信任的环境里用。
en: No sandbox; every command runs right away. Only use it in an environment you trust.
zh_hant: 不受沙盒限制，任何命令都會直接執行。只在你信任的環境里用。

source: 不同意
en: Don't Allow

source: 不回答
en: Skip

source: 不在同一个网络时，比如通过 Tailscale，填对方的地址。对方的地址在它的 设置 › 同步与共享 里，对方需要开着 Conch。
en: When you're not on the same network, for example over Tailscale, enter the other device's address. It's shown in that device's Settings › Sync & Share, and Conch must be open there.
zh_hant: 不在同一個網路時，比如透過 Tailscale，填對方的位址。對方的位址在它的 設定 › 同步與共享 裡，對方需要開著 Conch。

source: 不填也能用，只是免 Key 的额度有限，用得多会被限流。填了以后优先用自己的 Key；Key 无效或额度用完时自动退回免 Key。Key 只保存在本机钥匙串里。
en: Optional. Without keys both services still work, but the free tier is rate-limited when used heavily. Saved keys are used first; if a key is invalid or out of credit, Conch falls back to the free tier. Keys are stored only in this device's keychain.
zh_hant: 不填也能用，只是免 Key 的額度有限，用得多會被限流。填了以後優先用自己的 Key；Key 無效或額度用完時自動退回免 Key。Key 只儲存在本機鑰匙圈裡。

source: 不是文字内容（%@）
en: Not text content (%@)
zh_hant: 不是文字內容（%@）

source: 不是有效的 Office 文件（打不开压缩包）
en: Not a valid Office file (the package can't be opened)
zh_hant: 不是有效的 Office 檔案（打不開壓縮檔）

source: 不透明度
en: Opacity

source: 不透明度=%lld%%
en: opacity=%lld%%

source: 不透明度低于 100% 时，会透出模糊处理后的桌面。
en: Below 100%, the blurred desktop shows through.
zh_hant: 不透明度低於 100% 時，會透出模糊處理後的桌面。

source: 不限时
en: No limit
zh_hant: 不限時

source: 两次输入的密码不一样
en: The passwords don't match
zh_hant: 兩次輸入的密碼不一樣

source: 中
en: Medium

source: 为 %@ 配置免密登录？
en: Set up key login for %@?
zh_hant: 為 %@ 配置免密登入？

source: 主机
en: Host
zh_hant: 主機

source: 主目录
en: Home
zh_hant: 主目錄

source: 主题
en: Theme
zh_hant: 主題

source: 主题=%@
en: theme=%@
zh_hant: 主題=%@

source: 主题决定整个 App 的配色：终端、服务器列表、设置和对话页都会跟着变。
en: The theme colors the whole app: the terminal, the server list, settings and conversations all follow it.
zh_hant: 主題決定整個 App 的配色：終端、伺服器列表、設定和對話頁都會跟著變。

source: 之后的回复使用：%@
en: Next replies use: %@
zh_hant: 之後的回覆使用：%@

source: 也可以在设置 › Tailscale 里从 Tailnet 的设备添加，或从另一台设备同步过来。
en: You can also add one from your tailnet in Settings › Tailscale, or sync from another device.
zh_hant: 也可以在設定 › Tailscale 裡從 Tailnet 的裝置加入，或從另一台裝置同步過來。

source: 也可以填完整的模型名，比如接入其他服务时用的名称。
en: You can also enter a full model name, such as one from another provider.
zh_hant: 也可以填完整的模型名，比如接入其他服務時用的名稱。

source: 也存进了共享文件夹：%@
en: Also saved in the shared folder: %@
zh_hant: 也存進了共享資料夾：%@

source: 二维码
en: QR Code
zh_hant: QR 碼

source: 二维码最多约 2300 字节（英文约 2300 个字符，中文约 770 个字）。
en: A QR code holds about 2,300 bytes (about 2,300 English characters or 770 Chinese characters).
zh_hant: QR 碼最多約 2300 位元組（英文約 2300 個字元，中文約 770 個字）。

source: 云端多代理深度审查（收费）
en: Deep multi-agent review in the cloud (paid)
zh_hant: 雲端多代理深度審查（收費）

source: 交给 %@：%@
en: Hand to %@: %@
zh_hant: 交給 %@：%@

source: 交给你：%@
en: Handing over: %@
zh_hant: 交給你：%@

source: 亮度已调到 %lld%%
en: Brightness set to %lld%%
zh_hant: 亮度已調到 %lld%%

source: 从 %@ 下载文件？
en: Download a file from %@?
zh_hant: 從 %@ 下載檔案？

# 从 %@ 下载：%@
source: 从 %1$@ 下载：%2$@
en: Download from %@: %@
zh_hant: 從 %@ 下載：%@

source: 从文件导入
en: Import from File
zh_hant: 從檔案匯入

source: 从文件导入…
en: Import from File…
zh_hant: 從檔案匯入…

source: 从文件选择…
en: Choose File…
zh_hant: 從檔案選擇…

source: 从服务器下载
en: Download from Server
zh_hant: 從伺服器下載

source: 优先使用自建中转
en: Prefer Own Relay
zh_hant: 優先使用自建中繼

source: 会把密钥“%@”的公钥追加到 %@ 的 ~/.ssh/authorized_keys，验证成功后改用密钥登录。
en: Adds the public key of “%@” to %@'s ~/.ssh/authorized_keys and, once verified, switches to key login.
zh_hant: 會把金鑰“%@”的公鑰追加到 %@ 的 ~/.ssh/authorized_keys，驗證成功後改用金鑰登入。

source: 会添加新的服务器、更新较旧的，不会删除这台设备上的任何内容。
en: New servers are added and older ones updated. Nothing on this device is deleted.
zh_hant: 會新增新的伺服器、更新較舊的，不會刪除這台裝置上的任何內容。

source: 会生成一把 Ed25519 密钥，私钥只保存在本机钥匙串中。生成后拷贝公钥，追加到服务器的 ~/.ssh/authorized_keys 即可。
en: Generates an Ed25519 key; the private key stays in this device's keychain. Afterwards, copy the public key and add it to ~/.ssh/authorized_keys on the server.
zh_hant: 會生成一把 Ed25519 金鑰，私鑰只保存在本機鑰匙圈中。生成後拷貝公鑰，追加到伺服器的 ~/.ssh/authorized_keys 即可。

source: 会话保持
en: Session Persistence
zh_hant: 會話保持

source: 会话名称
en: Session Name
zh_hant: 會話名稱

source: 会话：%@
en: Session: %@
zh_hant: 會話：%@

source: 位置
en: Location

source: 位置未知
en: Location unknown

source: 低
en: Low

source: 低电量模式：%@
en: Low Power Mode: %@
zh_hant: 低電量模式：%@

source: 你和 AI 助手共用这个文件夹：放进来的文件助手可以直接读、改、整理，助手做好的文件也存在这里。在微信等 App 里选“用其他应用打开” › Conch，文件会存进“收到的文件”，并直接出现在助手的输入框里。
en: You and the AI assistant share this folder: the assistant can read, edit and organize the files you put here, and the files it makes are saved here too. In WeChat and other apps, choose “Open in…” › Conch: the file is saved in “Received” and shows up right in the assistant's input box.
zh_hant: 你和 AI 助手共用這個資料夾：放進來的檔案助手可以直接讀、改、整理，助手做好的檔案也存在這裡。在微信等 App 裡選“用其他應用打開” › Conch，檔案會存進“收到的檔案”，並直接出現在助手的輸入框裡。

source: 你是连通性测试。
en: You are a connectivity test.
zh_hant: 你是連通性測試。

source: 你附上的照片和文件
en: Photos and files you attach
zh_hant: 你附上的照片和檔案

source: 使用
en: Use

source: 使用了 %lld 个工具
en: used %lld tools
zh_hant: 使用了 %lld 個工具

source: 例如 deepseek-v4.1-flash、qwen-max、gpt-5
en: e.g. deepseek-v4.1-flash, qwen-max, gpt-5

source: 例如：MacBook
en: e.g. MacBook

source: 例如：我的项目都放在 ~/code 下
en: e.g. My projects live in ~/code
zh_hant: 例如：我的專案都放在 ~/code 下

source: 保存
en: Save

source: 保存 PDF 失败
en: Couldn't save the PDF
zh_hant: 儲存 PDF 失敗

source: 保存了 %lld 个密码或私钥
en: saved %lld passwords or keys
zh_hant: 儲存了 %lld 個密碼或私密金鑰

source: 保存并测试
en: Save and Test
zh_hant: 保存並測試

source: 信任并连接
en: Trust and Connect
zh_hant: 信任並連線

# 修改 %@ 上的 %@？
source: 修改 %1$@ 上的 %2$@？
en: Edit %2$@ on %1$@?
zh_hant: 修改 %@ 上的 %@？

# 修改 %@%@
source: 修改 %1$@%2$@
en: Edit %@%@
zh_hant: 修改 %@%@

source: 修改了 %lld 个文件
en: edited %lld files
zh_hant: 修改了 %lld 個檔案

source: 修改文件
en: Edit Files
zh_hant: 修改檔案

source: 修改服务器 %@
en: Update server %@
zh_hant: 修改伺服器 %@

source: 停止
en: Stop

source: 停止语音输入
en: Stop Dictation
zh_hant: 停止語音輸入

source: 停止载入
en: Stop Loading
zh_hant: 停止載入

source: 允许
en: Allow
zh_hant: 允許

source: 允许其他设备发送给我
en: Allow Other Devices to Send to Me
zh_hant: 允許其他裝置傳送給我

source: 允许并继续
en: Allow and Continue
zh_hant: 允許並繼續

source: 充电中
en: charging
zh_hant: 充電中

source: 先在“服务器”里添加一台。
en: Add one in Servers first.
zh_hant: 先在“伺服器”裡新增一台。

source: 光标
en: Cursor
zh_hant: 游標

source: 光标=%@
en: cursor=%@
zh_hant: 游標=%@

source: 光标闪烁=%@
en: cursor blink=%@
zh_hant: 游標閃爍=%@
